app/controllers/images_controller.rb

    def show
        @image = Image.find(params[:id])
---
SELECT `images`.* FROM `images` WHERE `images`.`id` = 1 LIMIT 1

    def create
        @image = Image.create(image_params())
---
INSERT INTO `images` (`created_at`, `updated_at`) VALUES ('2021-01-10 21:16:37.355139', '2021-01-10 21:16:37.355139')